gregnetzel/CPSC-5530/FreeRTOS/Demo/CORTEX_LM3Sxxxx_IAR_Keil/main.c
int main( void ){
  prvSetupHardware();
  
  /* Create the queue used by the OLED task.  Messages for display on the OLED
	are received via this queue. */
  xOLEDQueue = xQueueCreate( mainOLED_QUEUE_SIZE, sizeof( xOLEDMessage ) );
  
  /* Start the standard demo tasks. 
  vStartIntegerMathTasks( mainINTEGER_TASK_PRIORITY );
  vStartGenericQueueTasks( mainGEN_QUEUE_TASK_PRIORITY );
  vStartInterruptQueueTasks();
  vStartRecursiveMutexTasks();
  vStartBlockingQueueTasks( mainBLOCK_Q_PRIORITY );
  vCreateBlockTimeTasks();
  vStartSemaphoreTasks( mainSEM_TEST_PRIORITY );
  vStartPolledQueueTasks( mainQUEUE_POLL_PRIORITY );
  vStartQueuePeekTasks();
  vStartQueueSetTasks();
  vStartEventGroupTasks();
  */
  /* Exclude some tasks if using the kickstart version to ensure we stay within
	the 32K code size limit. */
#if mainINCLUDE_WEB_SERVER != 0 
  {
    /* Create the uIP task if running on a processor that includes a MAC and
		PHY. */
    if( SysCtlPeripheralPresent( SYSCTL_PERIPH_ETH ) ) {
      xTaskCreate( vuIP_Task, "uIP", mainBASIC_WEB_STACK_SIZE, NULL, mainCHECK_TASK_PRIORITY - 1, NULL );
    }
  }
#endif
  
  
  xTaskCreate( vDisplayMaker, "DISP", 2000, NULL, tskIDLE_PRIORITY, NULL);
  /* Start the tasks defined within this file/specific to this demo. */
  xTaskCreate( vOLEDTask, "OLED", mainOLED_TASK_STACK_SIZE, NULL, tskIDLE_PRIORITY, NULL );
  
  /* The suicide tasks must be created last as they need to know how many
	tasks were running prior to their creation in order to ascertain whether
	or not the correct/expected number of tasks are running at any given time. */
  vCreateSuicidalTasks( mainCREATOR_TASK_PRIORITY );
  
  /* Configure the high frequency interrupt used to measure the interrupt
	jitter time. */
  vSetupHighFrequencyTimer();
  
  
  /* Start the scheduler. */
  vTaskStartScheduler();
  
  /* Will only get here if there was insufficient memory to create the idle
    task. */
  return 0;
}
/*-----------------------------------------------------------*/
/* New Functions */
void vDisplayMaker(void *pvParameters){//builds char buffer
  mode = 0;
  xOLEDMessage xMessage;
  memset( displayBuffer, 0, 300 );
  TickType_t xLastWakeTime;
  const char notSelected = ' ';
  const char selected = '*';
  const TickType_t xFrequency = 20; //ticks to wait
  xLastWakeTime = xTaskGetTickCount();
  char* temp;
  
  for(;;){
     vTaskDelayUntil( &xLastWakeTime, xFrequency );
    if (selectPressed == 1){
      selectPressed = 0;
      upPressed = 0;
      downPressed = 0;
      RIT128x96x4Clear();
      switch(mode) {
      case 0:
        mode = 2;
        break;
      case 1:
        mode = 5;      
        break;
      case 2:
        mode = 6;
        break;
      case 3:
        mode = 7;
        break;
      case 4:
        mode = 8;
        break;
      case 5:
        bpHigh = FALSE;
        break;
      }
    }
    else{
      if (upPressed == 1){
        switch(mode) {
        case 0:
          break;
        case 1:
          mode = 0;
          break;
        case 2:
          break;
        case 3:
          mode = 2;
          break;
        case 4:
          mode = 3;
          break;
        }
        upPressed = 0;
      }
      if (downPressed == 1){
        RIT128x96x4Clear();
        switch(mode) {
        case 0:
          mode = 1;
          break;
        case 1:
          break;
        case 2:
          mode = 3;
          break;
        case 3:
          mode = 4;
          break;
        case 4:
          break;
        }
        downPressed = 0;
      }
      if (leftPressed == 1){
        RIT128x96x4Clear();
        switch(mode) {
        case 2:
        case 3:
        case 4:
          mode = 0;
          break;
        case 5:
          mode = 1;
          break;
        case 6:
          mode = 2;
          break;
        case 7:
          mode = 3;
          break;
        case 8:
          mode = 4;
          break;
        }
        leftPressed = 0;
      }
    }
    
    if( mode == MENU_HOVER || mode == ANNUN_HOVER ){  // mode selection
      temp = displayBuffer;
      sprintf( displayBuffer, "Please select a Mode:");
      temp += strlen( "Please select a Mode:" );
      temp = 0x00;
      xMessage.pcMessage = (signed char *)displayBuffer;
      xQueueSend( xOLEDQueue, ( void * ) &xMessage, ( TickType_t ) 0 );      
      if( mode == MENU_HOVER){//  menu mode hover
        //print("* Menu", 0, 1);
      }
      else{
        //print("  Menu", 0, 1);
      }
      
      if( mode == ANNUN_HOVER){//  annunciate hover
        //print("* Annunciate", 0, 2);
      }
      else{
        //print("  Annunciate", 0, 2);
      }
    }
    
    if( mode == BP_HOVER || mode == TEMP_HOVER || mode == HR_HOVER){  // Menu Mode
      //print("Menu", 0, 0);
      
      if( mode == HR_HOVER ){//  Heart Rate hover
        //print("* Heart Rate", 0, 1);
      }
      else{
        //print("  Heart Rate", 0, 1);
      }
      
      if( mode == BP_HOVER){    //  Blood Pressure hover
        //print("* Blood Pressure", 0, 3);
      }
      else{
        //print("  Blood Pressure", 0, 3);
      }
      
      if( mode == TEMP_HOVER ){    //  Temperature hover
        //print("* Temperature", 0, 5);
      }
      else{
        //print("  Temperature", 0, 5);
      }
    }
    
    if( mode == BP || mode == HR || mode == TEMP){  // Menu option display
      //print("Menu", 0, 0);
      
      if( mode == BP){  // Blood Pressure
        //print("Blood Pressure", 0, 1);
        //volatile int t = *((Display*)data)->bloodPressCorrectedBuff;
        //intPrint(((Display*)data)->bloodPressCorrectedBuff[j], 3, 0, 2);         //Systolic: should never be over 3 char
        //print("/", 3, 2);
        //intPrint(((Display*)data)->bloodPressCorrectedBuff[j+8], 5, 4, 2);         //Diastolic: should never be over 5 char        
        //print("mm Hg", 9, 2);
      }
      
      if( mode == TEMP){  // temperature
        //print("Temperature:", 0, 1);
        //fPrint(((Display*)data)->tempCorrectedBuff[j], 4, 0, 2);               //Temperature: should never be over 4 char
        //print("C", 4, 2);
      }
      
      if( mode == HR){  // heart rate
        //print("Heart Rate:", 0, 1);
        //intPrint(((Display*)data)->pulseRateCorrectedBuff[j], 3, 0, 2);        //Heartrate: should never be over 3 char
        //print("BPM", 3, 2);
      }
    }
    
