gregnetzel/CPSC-5530/FreeRTOS/Demo/CORTEX_LM3Sxxxx_IAR_Keil/main.c
    if( mode == ANNUNCIATE){  // Annunciate Mode
      /*print("Annunciate:", 0, 0);
      volatile int t = *((Display*)data)->bloodPressCorrectedBuff;
      intPrint(((Display*)data)->bloodPressCorrectedBuff[j], 3, 0, 1);         //Systolic: should never be over 3 char
      print("/", 3, 1);
      intPrint(((Display*)data)->bloodPressCorrectedBuff[j+8], 5, 4, 1);         //Diastolic: should never be over 5 char
      print("mm Hg", 9, 1);
      
      fPrint(((Display*)data)->tempCorrectedBuff[j], 4, 0, 2);               //Temperature: should never be over 4 char
      print("C", 4, 2);
      intPrint(((Display*)data)->pulseRateCorrectedBuff[j], 3, 6, 2);        //Heartrate: should never be over 3 char
      print("BPM", 9, 2);
      
      intPrint(*((Display*)data)->batteryState, 3, 13, 2);    //battery: should never be over 3 char
    */
    }
  }
}

/* Built in Functions */
void prvSetupHardware( void ){
  /* If running on Rev A2 silicon, turn the LDO voltage up to 2.75V.  This is
    a workaround to allow the PLL to operate reliably. */
  if( DEVICE_IS_REVA2 ){
    SysCtlLDOSet( SYSCTL_LDO_2_75V );
  }
  
  /* Set the clocking to run from the PLL at 50 MHz */
  SysCtlClockSet( SYSCTL_SYSDIV_4 | SYSCTL_USE_PLL | SYSCTL_OSC_MAIN | SYSCTL_XTAL_8MHZ );
  
  /* 	Enable Port F for Ethernet LEDs
		LED0        Bit 3   Output
		LED1        Bit 2   Output */
  SysCtlPeripheralEnable( SYSCTL_PERIPH_GPIOF );
  GPIODirModeSet( GPIO_PORTF_BASE, (GPIO_PIN_2 | GPIO_PIN_3), GPIO_DIR_MODE_HW );
  GPIOPadConfigSet( GPIO_PORTF_BASE, (GPIO_PIN_2 | GPIO_PIN_3 ), GPIO_STRENGTH_2MA, GPIO_PIN_TYPE_STD );
  
  /* setup buttons */
  SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOE);         
  GPIOPinTypeGPIOInput(GPIO_PORTE_BASE, GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2);
  GPIOPadConfigSet(GPIO_PORTE_BASE, GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2, GPIO_STRENGTH_2MA, GPIO_PIN_TYPE_STD_WPU);
  GPIOIntTypeSet(GPIO_PORTE_BASE, GPIO_PIN_0 | GPIO_PIN_1, GPIO_FALLING_EDGE);
  GPIOPinIntEnable(GPIO_PORTE_BASE, GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2);
  IntEnable(INT_GPIOE);
  SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);  
  GPIOPinTypeGPIOInput(GPIO_PORTF_BASE, GPIO_PIN_1);
  GPIOPadConfigSet(GPIO_PORTF_BASE, GPIO_PIN_1, GPIO_STRENGTH_2MA,GPIO_PIN_TYPE_STD_WPU);
  GPIOIntTypeSet(GPIO_PORTF_BASE, GPIO_PIN_1, GPIO_FALLING_EDGE);
  GPIOPinIntEnable(GPIO_PORTF_BASE, GPIO_PIN_1);
  IntEnable(INT_GPIOF);
  
  vParTestInitialise();
}
/*-----------------------------------------------------------*/

void vApplicationTickHook( void ){
  static xOLEDMessage xMessage = { "PASS" };
  static unsigned long ulTicksSinceLastDisplay = 0;
  portBASE_TYPE xHigherPriorityTaskWoken = pdFALSE;
  
  /* Called from every tick interrupt.  Have enough ticks passed to make it
	time to perform our health status check again? */
  ulTicksSinceLastDisplay++;
  if( ulTicksSinceLastDisplay >= mainCHECK_DELAY ){
    ulTicksSinceLastDisplay = 0;
    
    /* Has an error been found in any task? */
    if( xAreGenericQueueTasksStillRunning() != pdTRUE ){
      xMessage.pcMessage = "ERROR IN GEN Q";
    }
    else if( xIsCreateTaskStillRunning() != pdTRUE ){
      xMessage.pcMessage = "ERROR IN CREATE";
    }
    else if( xAreIntegerMathsTaskStillRunning() != pdTRUE ){
      xMessage.pcMessage = "ERROR IN MATH";
    }
    else if( xAreIntQueueTasksStillRunning() != pdTRUE ){
      xMessage.pcMessage = "ERROR IN INT QUEUE";
    }
    else if( xAreBlockingQueuesStillRunning() != pdTRUE ){
      xMessage.pcMessage = "ERROR IN BLOCK Q";
    }
    else if( xAreBlockTimeTestTasksStillRunning() != pdTRUE ){
      xMessage.pcMessage = "ERROR IN BLOCK TIME";
    }
    else if( xAreSemaphoreTasksStillRunning() != pdTRUE ){
      xMessage.pcMessage = "ERROR IN SEMAPHORE";
    }
    else if( xArePollingQueuesStillRunning() != pdTRUE ){
      xMessage.pcMessage = "ERROR IN POLL Q";
    }
    else if( xAreQueuePeekTasksStillRunning() != pdTRUE ){
      xMessage.pcMessage = "ERROR IN PEEK Q";
    }
    else if( xAreRecursiveMutexTasksStillRunning() != pdTRUE ){
      xMessage.pcMessage = "ERROR IN REC MUTEX";
    }
    else if( xAreQueueSetTasksStillRunning() != pdPASS ){
      xMessage.pcMessage = "ERROR IN Q SET";
    }
    else if( xAreEventGroupTasksStillRunning() != pdTRUE ){
      xMessage.pcMessage = "ERROR IN EVNT GRP";
    }
    
    configASSERT( strcmp( ( const char * ) xMessage.pcMessage, "PASS" ) == 0 );
    
    /* Send the message to the OLED gatekeeper for display. */
    xHigherPriorityTaskWoken = pdFALSE;
    xQueueSendFromISR( xOLEDQueue, &xMessage, &xHigherPriorityTaskWoken );
  }
  
  /* Write to a queue that is in use as part of the queue set demo to
	demonstrate using queue sets from an ISR. */
  vQueueSetAccessQueueSetFromISR();
  
  /* Call the event group ISR tests. */
  vPeriodicEventGroupsProcessing();
}
/*-----------------------------------------------------------*/

void vOLEDTask( void *pvParameters ){
  xOLEDMessage xMessage;
  unsigned long ulY, ulMaxY;
  static char cMessage[ mainMAX_MSG_LEN ];
  extern volatile unsigned long ulMaxJitter;
  const unsigned char *pucImage;
  
  /* Functions to access the OLED.  The one used depends on the dev kit
  being used. */
  void ( *vOLEDInit )( unsigned long ) = NULL;
  void ( *vOLEDStringDraw )( const char *, unsigned long, unsigned long, unsigned char ) = NULL;
  void ( *vOLEDImageDraw )( const unsigned char *, unsigned long, unsigned long, unsigned long, unsigned long ) = NULL;
  void ( *vOLEDClear )( void ) = NULL;
  
  /* Map the OLED access functions to the driver functions that are appropriate
	for the evaluation kit being used. */
  switch( HWREG( SYSCTL_DID1 ) & SYSCTL_DID1_PRTNO_MASK ){
    case SYSCTL_DID1_PRTNO_6965	:
    case SYSCTL_DID1_PRTNO_2965	:	
      vOLEDInit = OSRAM128x64x4Init;
      vOLEDStringDraw = OSRAM128x64x4StringDraw;
      vOLEDImageDraw = OSRAM128x64x4ImageDraw;
      vOLEDClear = OSRAM128x64x4Clear;
      ulMaxY = mainMAX_ROWS_64;
      pucImage = pucBasicBitmap;
      break;
  
    case SYSCTL_DID1_PRTNO_1968	:
    case SYSCTL_DID1_PRTNO_8962 :	
      vOLEDInit = RIT128x96x4Init;
      vOLEDStringDraw = RIT128x96x4StringDraw;
      vOLEDImageDraw = RIT128x96x4ImageDraw;
      vOLEDClear = RIT128x96x4Clear;
      ulMaxY = mainMAX_ROWS_96;
      pucImage = pucBasicBitmap;
      break;
  
    default:
      vOLEDInit = vFormike128x128x16Init;
      vOLEDStringDraw = vFormike128x128x16StringDraw;
      vOLEDImageDraw = vFormike128x128x16ImageDraw;
      vOLEDClear = vFormike128x128x16Clear;
      ulMaxY = mainMAX_ROWS_128;
      pucImage = pucGrLibBitmap;
      break;
  }
  
