gregnetzel/CPSC-5530/FreeRTOS/Demo/CORTEX_LM3Sxxxx_IAR_Keil/main.c
  ulY = ulMaxY;
  
  /* Initialise the OLED and display a startup message. */
  vOLEDInit( ulSSI_FREQUENCY );
  vOLEDStringDraw( "POWERED BY FreeRTOS", 0, 0, mainFULL_SCALE );
  vOLEDImageDraw( pucImage, 0, mainCHARACTER_HEIGHT + 1, bmpBITMAP_WIDTH, bmpBITMAP_HEIGHT );
  
  for( ;; ){
    /* Wait for a message to arrive that requires displaying. */
    xQueueReceive( xOLEDQueue, &xMessage, portMAX_DELAY );
    
    /* Write the message on the next available row. */
    ulY += mainCHARACTER_HEIGHT;
    if( ulY >= ulMaxY ){
      ulY = mainCHARACTER_HEIGHT;
      vOLEDClear();
      vOLEDStringDraw( pcWelcomeMessage, 0, 0, mainFULL_SCALE );
    }
    
    /* Display the message along with the maximum jitter time from the
		high priority time test. */
    sprintf( cMessage, "%s, xMessage.pcMessage);// [%uns]", xMessage.pcMessage, ulMaxJitter * mainNS_PER_CLOCK );
    vOLEDStringDraw( cMessage, 0, ulY, mainFULL_SCALE );
  }
}
/*-----------------------------------------------------------*/

void vApplicationStackOverflowHook( TaskHandle_t *pxTask, signed char *pcTaskName ){
  ( void ) pxTask;
  ( void ) pcTaskName;
  
  for( ;; );
}
/*-----------------------------------------------------------*/

void vAssertCalled( const char *pcFile, unsigned long ulLine ){
  volatile unsigned long ulSetTo1InDebuggerToExit = 0;
  
  taskENTER_CRITICAL();{
    while( ulSetTo1InDebuggerToExit == 1 ){
      /* Nothing do do here.  Set the loop variable to a non zero value in
			the debugger to step out of this function to the point that caused
			the assertion. */
      ( void ) pcFile;
      ( void ) ulLine;
    }
  }
  taskEXIT_CRITICAL();
}
